// Многократный проход по массиву с попарным сравнением и обменом соседних элементов.
const arr = [99, 1, 2, 58, 4, 62, 6, 7, 8, 9, 10, 11, 52, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 0, 12, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 5, 53, 54, 55, 56, 57, 27, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 3, 100];
let count = 0;

// Сортировка пузырьком O(n²) по сравнению с сортировкой выбором ещё менее эффективен, хоть и сложность у них одинаковая.
function bubbleSort(array){
    for(let i = 0; i < array.length; i++){
        for(let j = 0; j < array.length; j++){
            if(array[j + 1] < array[j]){
                let tmp = array[j]
                array[j] = array[j + 1]
                array[j + 1] = tmp
            }
            count++;
        }
    }
    return array;
}

console.log(bubbleSort(arr));
console.log('count = ', count); // 10201